{
	"jobs": [
		{
			"title": "Citibank",
			"position": "Senior Application Developer / Application Developer Analyst 2",
			"dates": "June 2019- Present",
			"text": "Currently working in in Citi Private Bank on the Innovation Team. Designed and led implementation of a data aggregation/analysis platform and a NLP based automation platform which were rolled out to a combined 100 users. Led POCs/evaluations with emerging companies and technologies for use within the bank. Managed database, Linux server and OpenShift cluster infrastructure for the team. Setup and maintained CI/CD pipelines for the team leading to a 75% reduction in manual touchpoints for deployments."
		},
		{
			"title": "Citibank",
			"position": "Application Developer Analyst 1",
			"dates": "June 2018 - June 2019",
			"text": "Worked on the Commercial Cards Data Management Team. Developed custom Java/SQL based ETL report generation jobs for institutional clients. Led initiative to upgrade internal tooling to move towards CI/CD leading to 50% faster and low touch deployments."
		},
		{
			"title": "Citibank",
			"position": "Co-Op Analyst",
			"dates": "January 2017 - July 2017",
			"text": "Worked in the Equities Analytics group. Developed Java and Python APIs for consuming and calculating statistics on market data. Developed APIs in Python and Java for reading and writing modified AVRO messages. Worked on proof of concepts on emerging technologies (Docker, High Performance Databases, ReST ) and its potential application to products within the team."
		},
		{
			"title": "Fidelity Investments",
			"position": "Summer Intern",
			"dates": "May 2016 - August 2016",
			"text": "Software Engineering role. Worked in Agile/SCRUM teams to implement features into existing applications, rewrite front end for legacy application and design ReST web service applications. Used AngularJs, Java and HTML/CSS."
		},
		{
			"title": "GE Aviation Systems Co-Op",
			"position": "Aviation Intern",
			"dates": "August 2015 - December 2015",
			"text": "Developed automated tracking systems for test equipment and project specific metrics. Developed automated tool to simplify procedures and improve efficiency. Wrote and formalized lab procedures for delivery to customer. Assisted in verifying and correcting test procedures."
		}
		
	]
}
